RT-Thread/rt-thread/bsp/gd32/arm/libraries/GD32F5xx_Firmware_Library/GD32F5xx_standard_peripheral/Source/gd32f5xx_pkcau.c
    /* write the modulus length and length of operand A in bit to PKCAU RAM */
    pkcau_memcpy_value(0x00000400U, (mod_reduc_para->oprd_a_len) << 3);
    pkcau_memcpy_value(0x00000404U, (mod_reduc_para->modulus_n_len) << 3);

    /* write the operand A and modulus value n to PKCAU RAM */
    pkcau_memcpy_operand(0x000008B4U, mod_reduc_para->oprd_a, mod_reduc_para->oprd_a_len);
    pkcau_memcpy_operand(0x00000A44U, mod_reduc_para->modulus_n, mod_reduc_para->modulus_n_len);
    /* configure the operation mode */
    pkcau_mode_set(PKCAU_MODE_MOD_REDUCTION);
    /* start computation */
    pkcau_start();

    /* wait for PKCAU operation completed */
    while(SET != pkcau_flag_get(PKCAU_FLAG_END)){
    }
    /* read results from RAM address */
    pkcau_memread(0xBD0U, (uint8_t *)results, mod_reduc_para->modulus_n_len);
    /* clear end flag */
    pkcau_flag_clear(PKCAU_FLAG_END);
    /* disable PKCAU */
    pkcau_disable();
}

/*!
    \brief      execute arithmetic operation
                This function can only be used when interrupt is not enabled
    \param[in]  arithmetic_para: PKCAU arithmetic parameter struct
                  oprd_a: operand A
                  oprd_a_len: length of operand A in byte
                  oprd_b: operand B
                  oprd_b_len: length of operand B in byte
    \param[in]  mode: arithmetic operation mode
                only one parameter can be selected which is shown as below:
      \arg        PKCAU_MODE_ARITHMETIC_ADD: arithmetic addition
      \arg        PKCAU_MODE_ARITHMETIC_SUB: arithmetic subtraction
      \arg        PKCAU_MODE_ARITHMETIC_MUL: arithmetic multiplication
      \arg        PKCAU_MODE_ARITHMETIC_COMP: arithmetic comparison
    \param[out] results: output buffer
    \retval     none
*/
void pkcau_arithmetic_operation(pkcau_arithmetic_parameter_struct *arithmetic_para, uint32_t mode, uint8_t *results)
{
    uint32_t size = 0U;

    uint32_t max_len = (arithmetic_para->oprd_a_len > arithmetic_para->oprd_b_len) ? \
                       arithmetic_para->oprd_a_len : arithmetic_para->oprd_b_len;

    /* reset PKCAU */
    pkcau_deinit();
    /* enable PKCAU */
    pkcau_enable();
    /* wait for PKCAU busy flag to reset */
    while(RESET != pkcau_flag_get(PKCAU_FLAG_BUSY)){
    }
    /* clear end flag */
    pkcau_flag_clear(PKCAU_FLAG_END);

    /* calculate number of byte to read */
    switch(mode) {
    case PKCAU_MODE_ARITHMETIC_ADD:
        size = max_len + 1U;
        break;
    case PKCAU_MODE_ARITHMETIC_SUB:
        size =  max_len;
        break;
    case PKCAU_MODE_ARITHMETIC_MUL:
        size =  arithmetic_para->oprd_a_len + arithmetic_para->oprd_b_len;
        break;
    case PKCAU_MODE_ARITHMETIC_COMP:
        size = 1U;
        break;
    default:
        break;
    }

    /* write the length of operand in bit to PKCAU RAM */
    pkcau_memcpy_value(0x00000404U, max_len << 3);

    /* write the operand A and operand B to PKCAU RAM */
    pkcau_memcpy_operand(0x000008B4U, arithmetic_para->oprd_a, arithmetic_para->oprd_a_len);
    pkcau_memcpy_operand(0x00000A44U, arithmetic_para->oprd_b, arithmetic_para->oprd_b_len);
    /* configure the operation mode */
    pkcau_mode_set(mode);
    /* start computation */
    pkcau_start();

    /* wait for PKCAU operation completed */
    while(SET != pkcau_flag_get(PKCAU_FLAG_END)){
    }
    /* read results from RAM address */
    pkcau_memread(0xBD0U, (uint8_t *)results, size);
    /* clear end flag */
    pkcau_flag_clear(PKCAU_FLAG_END);
    /* disable PKCAU */
    pkcau_disable();
}

/*!
    \brief      execute RSA CRT exponentiation operation
                This function can only be used when interrupt is not enabled
    \param[in]  crt_para: PKCAU modular CRT parameter struct
                  oprd_a: operand A
                  oprd_a_len: length of operand A in byte
                  oprd_dp: operand dp
                  oprd_dp_len: length of operand dp in byte
                  oprd_dq:operand dq
                  oprd_dq_len: length of operand dq in byte
                  oprd_qinv: operand qinv
                  oprd_qinv_len: length of operand qinv in byte
                  oprd_p: prime operand p
                  oprd_p_len: length of operand p in byte
                  oprd_q: prime operand q
                  oprd_q_len: length of operand q in byte
    \param[out] results: output buffer
    \retval     none
*/
void pkcau_crt_exp_operation(pkcau_crt_parameter_struct *crt_para, uint8_t *results)
{
    /* reset PKCAU */
    pkcau_deinit();
    /* enable PKCAU */
    pkcau_enable();
    /* wait for PKCAU busy flag to reset */
    while(RESET != pkcau_flag_get(PKCAU_FLAG_BUSY)){
    }
    /* clear end flag */
    pkcau_flag_clear(PKCAU_FLAG_END);

    /* write the modulus length in bit to PKCAU RAM */
    pkcau_memcpy_value(0x00000404U, (crt_para->oprd_a_len << 3));

    /* write the operand dp, dq, qinv, p and q to PKCAU RAM */
    pkcau_memcpy_operand(0x0000065CU, crt_para->oprd_dp, crt_para->oprd_dp_len);
    pkcau_memcpy_operand(0x00000BD0U, crt_para->oprd_dq, crt_para->oprd_dq_len);
    pkcau_memcpy_operand(0x000007ECU, crt_para->oprd_qinv, crt_para->oprd_qinv_len);
    pkcau_memcpy_operand(0x0000097CU, crt_para->oprd_p, crt_para->oprd_p_len);
    pkcau_memcpy_operand(0x00000D5CU, crt_para->oprd_q, crt_para->oprd_q_len);
    /* write the operand A to PKCAU RAM */
    pkcau_memcpy_operand(0x00000EECU, crt_para->oprd_a, crt_para->oprd_a_len);
    /* configure the operation mode */
    pkcau_mode_set(PKCAU_MODE_CRT_EXP);
    /* start computation */
    pkcau_start();

    /* wait for PKCAU operation completed */
    while(SET != pkcau_flag_get(PKCAU_FLAG_END)){
    }
    /* read results from RAM address */
    pkcau_memread(0x724U, (uint8_t *)results, crt_para->oprd_a_len);
    /* clear end flag */
    pkcau_flag_clear(PKCAU_FLAG_END);
    /* disable PKCAU */
    pkcau_disable();
}

/*!
    \brief      execute point check operation
                This function can only be used when interrupt is not enabled
    \param[in]  point_para: PKCAU point struct
                  point_x: point coordinate x
                  point_x_len: point coordinate x length in byte
                  point_y: point coordinate y
                  point_y_len: point coordinate y length in byte
    \param[in]  curve_group_para: PKCAU ECC curve parameter struct
                  modulus_p: curve modulus p
                  modulus_p_len: curve modulus p length in byte
                  coff_a: curve coefficient a
                  coff_a_len: curve coefficient a length in byte
                  coff_b: curve coefficient b
                  coff_b_len: curve coefficient b length in byte
                  base_point_x: curve base point coordinate x
                  base_point_x_len: curve base point coordinate x length in byte
                  base_point_y: curve base point coordinate y
                  base_point_y_len: curve base point coordinate y length in byte
                  order_n: curve prime order n
                  order_n_len: curve prime order n length in byte
                  a_sign: curve coefficient a sign
                  multi_k: scalar multiplier k
                  multi_k_len: scalar multiplier k length in byte
                  integer_k: integer k length in byte
                  integer_k_len: integer k length in byte
                  private_key_d: private key d
                  private_key_d_len: private key d length in byte
                  mont_para: montgomery parameter R2 mod n
                  mont_para_len: montgomery parameter R2 mod n length in byte
    \param[out] none
    \retval     flag indicating whether the point is on an elliptic curve or not
*/
uint8_t pkcau_point_check_operation(pkcau_point_parameter_struct *point_para,
                                    const pkcau_ec_group_parameter_struct *curve_group_para)
{
    uint8_t res = 1U;

